Pfannex/ADE7953_Breakoutboard/ESP8266_Basic.cpp
/******************************************************************************

  ProjectName: ESP8266 Basic template             ***** *****
  SubTitle   : Basic routines                    *     *     ************
                                                *   **   **   *           *
  Copyright by Pf@nne                          *   *   *   *   *   ****    *
                                               *   *       *   *   *   *   *
  Last modification by:                        *   *       *   *   ****    *
  - Pf@nne (pf@nne-mail.de)                     *   *     *****           *
                                                 *   *        *   *******
  Date    : 03.12.2016                            *****      *   *
  Version : alpha 0.200                                     *   *
  Revison :                                                *****

********************************************************************************/
#include "ESP8266_Basic.h"

//===> variables <---------------------------------------------------------

//BMP180 Luftdruck
  //Adafruit_BMP085 bmp;

//CLASS ESP8266_Basic################################################################
ESP8266_Basic::ESP8266_Basic() : webServer(), 
                                 mqtt_client(wifi_client),
                                 timeClient(ntpUDP, "europe.pool.ntp.org", 3600,1000){
                                 // By default 'time.nist.gov' is used with 60 seconds update interval and
                                 // no offset
                                 // You can specify the time server pool and the offset, (in seconds)
                                 // additionaly you can specify the update interval (in milliseconds).
                                 // NTPClient timeClient(ntpUDP, "europe.pool.ntp.org", 3600, 60000);

  //Callbacks								 
  webServer.set_saveConfig_Callback(std::bind(&ESP8266_Basic::cfgChange_Callback, this));
  mqtt_client.setCallback(std::bind(&ESP8266_Basic::mqttBroker_Callback, this, std::placeholders::_1, std::placeholders::_2, std::placeholders::_3));
}

//===============================================================================
//  incomming subscribe 
//===============================================================================
//===> incomming subscribe <---------------------------------------------------
void ESP8266_Basic::mqttBroker_Callback(char* topic, byte* payload, unsigned int length) {

  char value[500] = "";
  char chr[500] = "";
  int samples = 50;
  double inst[samples];
  String str = "";

  
  for (int i = 0; i < length; i++) {
    value[i] = payload[i];
  }

  Serial.print("incoming subscribe - LEN: ");
  Serial.print(length);
  Serial.print(" | ");
  Serial.print(topic);
  Serial.print(" | ");
  Serial.println(value);
  
  TdissectResult dissectResult;    
  dissectResult = dissectPayload(topic, value);

  if (dissectResult.found){
    
//201 ADE7953.read
    if (dissectResult.itemPath == "2/0/1"){
      String strReg = "0x";
      strReg += String(ADE.StrToInt(value), HEX);
      strcpy(chr, strReg.c_str());
      pub(2,0, chr);
      String str = ADE.getRegName(ADE.StrToInt(value));      
      strcpy(chr, str.c_str());
      pub(2,0,5, chr);
      
      uint32_t reg = ADE.read(String(value));
      str = "0x";
      str += String(reg, HEX);
      strcpy(chr, str.c_str());
      pub(2,0,0, chr);
      str = String(reg, BIN);
      strcpy(chr, str.c_str());
      pub(2,0,1, chr);
      str = String(reg);
      strcpy(chr, str.c_str());
      pub(2,0,2, chr);
    }
    
//202 ADE7953.write
    if (dissectResult.itemPath == "2/0/2"){   
      //Serial.println("Write to ADE");
            
      ADE.write(String(value));
      
      String strReg = "0x";
      int pos = String(value).indexOf(",");
      strReg += String(ADE.StrToInt(String(value).substring(0, pos)), HEX);
      
      strcpy(chr, strReg.c_str());
      pub(2,0, chr);
      String str = ADE.getRegName(ADE.StrToInt(value));      
      strcpy(chr, str.c_str());
      pub(2,0,5, chr);

      
      uint32_t reg = ADE.read(String(value));      
      str = "0x";
      str += String(reg, HEX);
      strcpy(chr, str.c_str());
      pub(2,0,0, chr);
      str = String(reg, BIN);
      strcpy(chr, str.c_str());
      pub(2,0,1, chr);
      str = String(reg);
      strcpy(chr, str.c_str());
      pub(2,0,2, chr);
    }

//203 ADE7953.readBit
    if (dissectResult.itemPath == "2/0/3"){               
      bool val = ADE.readBit(String(value));

      String strReg = "0x";
      int pos = String(value).indexOf(",");
      strReg += String(ADE.StrToInt(String(value).substring(0, pos)), HEX);
      strcpy(chr, strReg.c_str());
      pub(2,0, chr);
      String str = ADE.getRegName(ADE.StrToInt(value));      
      strcpy(chr, str.c_str());
      pub(2,0,5, chr);

      strReg = String(value).substring(pos+1);
      strcpy(chr, strReg.c_str());
      pub(2,0,3, chr);
      
      strReg = String(val);
      strcpy(chr, strReg.c_str());
      pub(2,0,4, chr);

      pub(2,0,0, "");
      
      uint32_t reg = ADE.read(ADE.StrToInt(String(value)));
      str = "0b";
      str = String(reg, BIN);
      strcpy(chr, str.c_str());     
      pub(2,0,1, chr);
      
      pub(2,0,2, "");
    }
    
//204 ADE7953.writeBit
    if (dissectResult.itemPath == "2/0/4"){   
      ADE.writeBit(String(value));

      String strReg = "0x";
      int pos = String(value).indexOf(",");
      strReg += String(ADE.StrToInt(String(value).substring(0, pos)), HEX);
      strcpy(chr, strReg.c_str());
      pub(2,0, chr);
      String str = ADE.getRegName(ADE.StrToInt(value));      
      strcpy(chr, str.c_str());
      pub(2,0,5, chr);

      uint32_t reg = ADE.read(ADE.StrToInt(strReg));
      str = "0x";
      str += String(reg, HEX);
      strcpy(chr, str.c_str());
      pub(2,0,0, chr);
      str = String(reg, BIN);
      strcpy(chr, str.c_str());
      pub(2,0,1, chr);
      str = String(reg);
      strcpy(chr, str.c_str());
      pub(2,0,2, chr);      
    }
    
//205 ADE7953.init
    if (dissectResult.itemPath == "2/0/5"){         
      ADE.init();
    }
    
//206 ADE7953.updateTime
    if (dissectResult.itemPath == "2/0/6"){         
      //Write Field_01
      strcpy(myFile.Field_01, value);
      write_MyFile();
      updateMeasure_time = String(value).toInt();
      Serial.print("UpdateMesure_time = "); Serial.println(value);
    }

