Pfannex/ADE7953_Breakoutboard/ESP8266_Basic.cpp
//207 ADE7953.saveConfig
    if (dissectResult.itemPath == "2/0/7"){         
      ADE.write_ADE7953_json();
    }

//208 ADE7953.setDefault
    if (dissectResult.itemPath == "2/0/8"){         
      ADE.setDefault();
    }

//209 ADE7953.resetEnergy
    if (dissectResult.itemPath == "2/0/9"){
      if (strcmp(value, "WA") == 0){
        ADE.energy[0] = 0;
      }
      if (strcmp(value, "WbA") == 0){
        ADE.energy[1] = 0;
      }
      if (strcmp(value, "WsA") == 0){
        ADE.energy[2] = 0;
      }
      if (strcmp(value, "WB") == 0){
        ADE.energy[3] = 0;
      }
      if (strcmp(value, "WbB") == 0){
        ADE.energy[4] = 0;
      }
      if (strcmp(value, "WsB") == 0){
        ADE.energy[5] = 0;
      }
    }
    

//210 ADE7953.get_VINST
    if (dissectResult.itemPath == "2/1/0"){   
      DynamicJsonBuffer JsonBuffer;
      JsonObject& root = JsonBuffer.parseObject(ADE.getWave(String(value).toInt(), V).c_str());
      //root.printTo(Serial); 
     for (auto &element : root){
        String Key = element.key;
        String Value = element.value;
        String samples = Key;
        samples += ",";
        samples += Value;
        
        //Serial.println(samples);      
        strcpy(chr, samples.c_str());      
        pub(2,1,15, chr);
      }
    }
//211 ADE7953.get_IAINST
    if (dissectResult.itemPath == "2/1/1"){   
      DynamicJsonBuffer JsonBuffer;
      JsonObject& root = JsonBuffer.parseObject(ADE.getWave(String(value).toInt(), IA).c_str());
      //root.printTo(Serial); 
     for (auto &element : root){
        String Key = element.key;
        String Value = element.value;
        String samples = Key;
        samples += ",";
        samples += Value;
        
        //Serial.println(samples);      
        strcpy(chr, samples.c_str());      
        pub(2,1,16, chr);
      }
    }
//212 ADE7953.get_IBINST
    if (dissectResult.itemPath == "2/1/2"){   
      DynamicJsonBuffer JsonBuffer;
      JsonObject& root = JsonBuffer.parseObject(ADE.getWave(String(value).toInt(), IB).c_str());
      //root.printTo(Serial); 
     for (auto &element : root){
        String Key = element.key;
        String Value = element.value;
        String samples = Key;
        samples += ",";
        samples += Value;
        
        //Serial.println(samples);      
        strcpy(chr, samples.c_str());      
        pub(2,1,17, chr);
      }
    }
   
//310 File/Read
    /*if (dissectResult.itemPath == "3/1/0"){
      //Write Field_01
      strcpy(myFile.Field_01, value);
      write_MyFile();
      updateMeasure_time = String(value).toInt();
      Serial.print("UpdateMesure_time = "); Serial.println(value);
    }*/
    
    /*if (dissectResult.itemPath == "1/0/0"){
      if (strcmp(value, "Reboot") == 0){
        ESP.restart();
      }
    }
    if (dissectResult.itemPath == "1/0/1"){
      pubConfig();
    }
    if (dissectResult.itemPath == "1/0/2"){
      //UpdateFirmware()
      webServer.updateFirmware();
    }
  
    if (dissectResult.itemPath == "3/0/0"){
      //Read Field_01
      strcpy(myFile.Field_01, "");
      read_MyFile();
      Serial.println(myFile.Field_01);
    }*/
  }
}

//===============================================================================
//  AktSen Control 
//===============================================================================
//===> updateMeasurement <-----------------------------------------------------
void ESP8266_Basic::handle_Measurement(){

  timeClient.update();
  ADE.updateEnergy();

  if (mqtt_client.connected()){
    long now = millis();
    if (now - lastMeasure_time > ADE.read(updateTimeMQTT)) {
      lastMeasure_time = now;
      //run_oneWire();
      //run_I2C();

      char chr[50];
      String strVal = ADE.formatDouble(ADE.getVRMS(),5);
      strcpy(chr, strVal.c_str());
      pub(2,1,0, chr);
      strVal = String(ADE.getVRMSrel());
      strcpy(chr, strVal.c_str());
      pub(2,1,18, chr);
     
      strVal = ADE.formatDouble(ADE.getIRMSA(),5);
      strcpy(chr, strVal.c_str());
      pub(2,1,1, chr);
      strVal = String(ADE.getIRMSArel());
      strcpy(chr, strVal.c_str());
      pub(2,1,19, chr);

      strVal = ADE.formatDouble(ADE.getIRMSB(),5);
      strcpy(chr, strVal.c_str());
      pub(2,1,2, chr);
      strVal = String(ADE.getIRMSBrel());
      strcpy(chr, strVal.c_str());
      pub(2,1,20, chr);

      strVal = String(ADE.getPFA());
      strcpy(chr, strVal.c_str());
      pub(2,1,3, chr);
      strVal = String(ADE.getPFB());
      strcpy(chr, strVal.c_str());
      pub(2,1,4, chr);
      strVal = String(ADE.getANGLE_A());
      strcpy(chr, strVal.c_str());
      pub(2,1,5, chr);
      strVal = String(ADE.getANGLE_B());
      strcpy(chr, strVal.c_str());
      pub(2,1,6, chr);
      strVal = String(ADE.getPERIOD());
      strcpy(chr, strVal.c_str());
      pub(2,1,7, chr);
      strVal = String(ADE.getFREQ());
      strcpy(chr, strVal.c_str());
      pub(2,1,8, chr);
      
      strVal = ADE.formatDouble(ADE.getP_A(),7);
      strcpy(chr, strVal.c_str());
      pub(2,1,9, chr);
      strVal = String(ADE.getP_Arel());
      strcpy(chr, strVal.c_str());
      pub(2,1,21, chr);
      
      strVal = ADE.formatDouble(ADE.getQ_A(),7);
      strcpy(chr, strVal.c_str());
      pub(2,1,10, chr);
      strVal = String(ADE.getQ_Arel());
      strcpy(chr, strVal.c_str());
      pub(2,1,22, chr);
      
      strVal = ADE.formatDouble(ADE.getS_A(),7);
      strcpy(chr, strVal.c_str());
      pub(2,1,11, chr);
      strVal = String(ADE.getS_Arel());
      strcpy(chr, strVal.c_str());
      pub(2,1,23, chr);
      
      strVal = ADE.formatDouble(ADE.getP_B(),7);
      strcpy(chr, strVal.c_str());
      pub(2,1,12, chr);
      strVal = String(ADE.getP_Brel());
      strcpy(chr, strVal.c_str());
      pub(2,1,24, chr);
      
      strVal = ADE.formatDouble(ADE.getQ_B(),7);
      strcpy(chr, strVal.c_str());
      pub(2,1,13, chr);
      strVal = String(ADE.getQ_Brel());
      strcpy(chr, strVal.c_str());
      pub(2,1,25, chr);
      
      strVal = ADE.formatDouble(ADE.getS_B(),7);
      strcpy(chr, strVal.c_str());
      pub(2,1,14, chr);
      strVal = String(ADE.getS_Brel());
      strcpy(chr, strVal.c_str());
      pub(2,1,26, chr);

      //Energy
      for (int i=0; i<6; i++){
        strVal = String(ADE.energy[i],7);
        strcpy(chr, strVal.c_str());
        pub(2,1,27+i, chr);
      }


