Pfannex/ADE7953_Breakoutboard/ESP8266_Basic.cpp
  webServer.handleClient();
  
  if (config_running == false){
    if (WiFi.status() == WL_CONNECTED) {
 	  mqtt_client.loop();
	  
	  if (!mqtt_client.connected()){
	    Serial.println("### MQTT has disconnected...");
	    mqtt_client.disconnect();
		strcpy(cfg.mqttStatus, "disconnected");
		start_MQTT();
	  }
	  
    }else{
      Serial.println("### WIFI has disconnected...");
	  if (!start_WiFi()){
		start_WiFi_connections();
	  }else{
	    Serial.println("### WIFI reconnect successful...");
	  };

      //publish_value(publish_status_topic[1], "off");
      //restart_wifi();
	  //WIFImanager();
	
	}
  }
  delay(1);
}


//===============================================================================
//  private WiFi-Manager-Control 
//===============================================================================

//===> start ConfigServer <----------------------------------------------------
void ESP8266_Basic::startConfigServer(){  
  webServer.set_cfgPointer(&cfg);
  //webServer.set_sensorPointer(&DS18B20_Sensors, &HTU21_Sensors, &BMP180_Sensors);
  webServer.start();
}

//===> start AP <--------------------------------------------------------------
void ESP8266_Basic::startAccessPoint(){
  Serial.println("AccessPoint start");
  WiFi.mode(WIFI_AP);
  WiFi.softAP(cfg.apName, cfg.apPassword);

  IPAddress myIP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
  Serial.println(myIP);

  startConfigServer();
}

//===> Set Function for save cfg Callback <------------------------------------
void ESP8266_Basic::cfgChange_Callback(){
  Serial.println("incomming Callback, config has changed!!");
  printCFG();
  write_cfgFile();
};

//===> WIFI SETUP <------------------------------------------------------------
bool ESP8266_Basic::start_WiFi(){
bool WiFiOK = false;

  delay(10);
  Serial.println();
  Serial.print("Connecting WiFi to: ");
  Serial.println(cfg.wifiSSID);
   
  WiFi.begin(cfg.wifiSSID, cfg.wifiPSK);

  int i = 0;
  while (WiFi.status() != WL_CONNECTED and i < 31) {
    delay(500);
    Serial.print(".");
	i++;
  }
  Serial.println("");
  
  if (WiFi.status() == WL_CONNECTED){
    WiFiOK = true; 
    WIFI_reconnect = true;
    Serial.println("");
    Serial.print("WiFi connected with IP:    ");Serial.println(WiFi.localIP());
	  strcpy( cfg.wifiIP, IPtoString(WiFi.localIP()).c_str()  );
	  strcpy( cfg.wifiSSID, WiFi.SSID().c_str() );
	  strcpy( cfg.wifiPSK, WiFi.psk().c_str() );
	
    //IPAddress ip = WiFi.localIP();
    //TopicHeader = ip[3];

    //MySQL   
    //start_MySQL();
    
  }  
  return WiFiOK; 
}

//===> MQTT SETUP <---------------------------------------------------------
bool ESP8266_Basic::start_MQTT(){
bool MQTTOK = false;

  Serial.print("Connecting to MQTT-Broker: ");
  Serial.print(cfg.mqttServer);Serial.print(":");Serial.println(cfg.mqttPort);
  
  mqtt_client.setServer(charToIP(cfg.mqttServer), atoi(cfg.mqttPort)); 
 
  if (mqtt_client.connect(cfg.mqttDeviceName)) {
    Serial.println("MQTT connected");
	strcpy(cfg.mqttStatus, "connected");
	MQTTOK = true;	        
	  
    if (WIFI_reconnect == true){
      WIFI_reconnect = false;
	  pub(1,0,0, "on");
	  pub(1,0,0, "off");
    }
    pub(1,0,1, "on");
    pub(1,0,1, "off");
	
    //broker_subcribe();
	String sub = cfg.mqttDeviceName;
	sub += "/#";
	mqtt_client.subscribe(sub.c_str());
    mqtt_client.loop();
	sub = "/";
	sub += cfg.mqttDeviceName;
	sub += "/#";
	mqtt_client.subscribe(sub.c_str());
    mqtt_client.loop();

  }

    //run_oneWire();
    run_I2C();
  
  return MQTTOK;
}


//===> MySQL SETUP <---------------------------------------------------------
/*void ESP8266_Basic::start_MySQL(){
 
  IPAddress server_addr(192,168,1,3);  // IP of the MySQL *server* here
  char user[] = "fhemuser";              // MySQL user login username
  char password[] = "fhempassword";        // MySQL user login password

  Serial.println("Connecting to MySQL-Server");
  MySQL_Connection conn((WiFiClient *)&wifi_client);
  if (conn.connect(server_addr, 3306, user, password)) {
    delay(100);
  }
  else
    Serial.println("Connection failed.");

  // Sample query
  //char INSERT_SQL[] = "use fhem; INSERT INTO `current`(`DEVICE`, `TYPE`, `EVENT`, `READING`, `VALUE`, `UNIT`) VALUES (´ESP8266-Ch01´, `temperature:55.55`, `temperature`, 55.55, ´°C´)";

  Serial.println("Recording data.");

  // Initiate the query class instance
  MySQL_Cursor *cur_mem = new MySQL_Cursor(&conn);
  // Execute the query
  cur_mem->execute("use fhem;");
  //cur_mem->execute("INSERT INTO `history`(`DEVICE`, `TYPE`, `EVENT`, `READING`, `VALUE`, `UNIT`) VALUES ([`ESP8266-Ch01`], [`1-Wire`], [`temperature:55.55`], [`temperature`], [55.55], [`C`]);");
  cur_mem->execute("INSERT INTO history (DEVICE, TYPE, EVENT, READING, VALUE, UNIT) VALUES ('ESP8266-Ch01', '1-Wire', 'temperature:55.55', 'temperature', 55.55, '°C');");

  
  // Note: since there are no results, we do not need to read any data
  // Deleting the cursor also frees up memory used
  delete cur_mem;
    
  conn.close();
    
}*/

//===============================================================================
//  Timer Stuff
//===============================================================================


void ESP8266_Basic::setup_Timer() {

  os_timer_setfn(&timer, tick, NULL);
  os_timer_arm(&timer, TIMER_T, true); // TIMER_T ms
}

void ESP8266_Basic::timerCallback() {
  
  ticks++;
  switch(currentLedMode) {
    case OFF:   Led(0); break;
    case ON:    Led(1); break;
    case BLINK: Led((ticks/BLINK_T) % 2); break;
  }
}

//===============================================================================
//  Peripherals
//===============================================================================

void ESP8266_Basic::setup_Peripherals() {

  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(LED_PIN, OUTPUT);
  for(int i= 0; i< 17; i++) {
      buttonPinState[i]= 0;
      lastDebounceTime[i]= 0;
  }
  pinMode(RELAY_PIN, OUTPUT);
  
}

// software debouncer
int ESP8266_Basic::getButtonPinState(int buttonPin) {

  // combine with hardware debouncer (100 nF capacitor from buttonPin to GND)
  
  int lastButtonPinState= buttonPinState[buttonPin];
  buttonPinState[buttonPin]= digitalRead(buttonPin); 
  unsigned long now= millis();
  /* char s[128];
  sprintf(s, "%d(%d) -> %d(%d)", lastButtonPinState, lastDebounceTime[buttonPin], 
    buttonPinState[buttonPin], now);
  Serial.println(s);   */
  if(buttonPinState[buttonPin] != lastButtonPinState)
    lastDebounceTime[buttonPin]= now;
  if(now - lastDebounceTime[buttonPin]> DEBOUNCETIME) 
    return buttonPinState[buttonPin];
  else
    return -1; // undecided, still bouncing
}

void ESP8266_Basic::printButtonMode(String msg, buttonMode_t mode) {
  
  Serial.println(msg+": Button mode S= "+String(mode.S)+
    " L= "+String(mode.L)+" button= "+String(mode.state)+
    " idle= "+String(mode.idle));
}

void ESP8266_Basic::setButtonMode(buttonMode_t mode) {
  
