Pfannex/ADE7953_Breakoutboard/ESP8266_Basic.cpp
  onSetButtonMode(currentButtonMode, mode);
  currentButtonMode= mode;
}

void ESP8266_Basic::handle_Peripherals() {

  // how to use the buttonMode?
  // - state signals if the button is up (0) or down (1)
  // - statex signals if state has been the same for at least BTIME milliseconds
  // - a short press of the button toggles the modeS between off (0) and on (1)
  // - a long press of the button toggles the modeL between off (0) and on (1)

  int buttonPinState= getButtonPinState(BUTTON_PIN);
  if(buttonPinState < 0) return; // still bouncing
  
  unsigned long now= millis();

  buttonMode_t mode= currentButtonMode;
  mode.state= !buttonPinState; // down if pin is 0
  if(mode.state != currentButtonMode.state) {
    // button changed
    mode.t= now;  
    /*Serial.println("Button changed to "+ 
      String(mode.state)+" @ "+String(mode.t));*/
    if(!mode.state) {
       // button up  
       if(mode.idle) mode.L= !mode.L; else mode.S= !mode.S;
    }
    mode.idle= 0;  
    setButtonMode(mode);
  } else {
    if(!mode.idle && (now - mode.t >= BTIME)) {
      mode.idle= 1;
      setButtonMode(mode);
    }
  }
}

void ESP8266_Basic::Led(int on) {
  
  digitalWrite(LED_PIN, on);
}

void ESP8266_Basic::Relay(int on) {

  digitalWrite(RELAY_PIN, on);
}

//===> button mode service routine --------------------------------------------

void ESP8266_Basic::onSetButtonMode(buttonMode_t oldMode, buttonMode_t newMode) {

  // examples for how to use the idle flag:
  // - if button is pressed, indicate that releasing the button will toggle the L mode
  // - leave an input mode when not button is pressed for some time

  /*printButtonMode("old", oldMode);
  printButtonMode("new", newMode);*/
  if(newMode.S != oldMode.S) {
    if(newMode.S) {
      if(!newMode.L) currentLedMode= ON;   // signalisation of Mode L takes precedence
      Relay(1);
      Serial.println("Relay is on.");
    } else { 
      if(!newMode.L) currentLedMode= OFF; // signalisation of Mode L takes precedence
      Relay(0);
      Serial.println("Relay is off.");
    }
  }
  if(newMode.L != oldMode.L) {
    if(newMode.L)
      Serial.println("God mode is on.");
    else 
      Serial.println("God mode is off.");
  } else {
    if(newMode.state && newMode.idle != oldMode.idle && newMode.idle) {
      if(newMode.L) {      
        Serial.println("Prepare to leave God mode.");
        if(newMode.S) currentLedMode= ON; else currentLedMode= OFF;
      } else  {
        Serial.println("Prepare to enter God mode.");
        currentLedMode= BLINK;
      }
    }
  }
}

//===============================================================================
//  Configuration 
//===============================================================================

//===> WIFI Manager Config <---------------------------------------------------
void  ESP8266_Basic::read_cfg(){

  Serial.println("read config");
  if (read_cfgFile()){
    Serial.println("fsMount OK and File exist");
  
  }else{
    Serial.println("create new config");
    strcpy(cfg.webUser, "ESPuser");
    strcpy(cfg.webPassword, "ESPpass");

    String str = "ESP8266_";
    str += String(ESP.getChipId());
    strcpy(cfg.apName, str.c_str());
    strcpy(cfg.apPassword, "ESP8266config");
	
    //strcpy(cfg.wifiSSID, "");
    //strcpy(cfg.wifiPSK, "");
    strcpy(cfg.wifiIP, "");
	
	//strcpy( cfg.wifiIP, IPtoString(WiFi.localIP()).c_str()  );
	strcpy( cfg.wifiSSID, WiFi.SSID().c_str() );
	strcpy( cfg.wifiPSK, WiFi.psk().c_str() );
	
    strcpy(cfg.mqttServer, "");
    strcpy(cfg.mqttPort, "1883");
    strcpy(cfg.mqttDeviceName, cfg.apName);
	
	write_cfgFile();
  }
}

//===> WIFI Manager <----------------------------------------------------------
void ESP8266_Basic::write_cfg() {
 
  //IPAddress ip = WiFi.localIP();
  //TopicHeader = ip[3];
  //String MQTT_DeviceName = TopicHeader;
  //MQTT_DeviceName += "/AktSen";
  //strcpy(cfg.mqttDeviceName, MQTT_DeviceName.c_str());
}

//===> Reset Settings <--------------------------------------------------------
void ESP8266_Basic::resetSettings(){
  Serial.println("resetSettings");
  strcpy(cfg.webUser, "");
  strcpy(cfg.webPassword, "");
  strcpy(cfg.apName, "");
  strcpy(cfg.apPassword, "");
  strcpy(cfg.wifiSSID, "");
  strcpy(cfg.wifiPSK, "");
  strcpy(cfg.wifiIP, "");
  strcpy(cfg.mqttServer, "");
  strcpy(cfg.mqttPort, "1883");
  strcpy(cfg.mqttDeviceName, "");
  strcpy(cfg.updateServer, "");
  strcpy(cfg.filePath, "");
  
  write_cfgFile();
}

//===============================================================================
//  FileSystem
//===============================================================================

//My File
//===> read from MyFile <-------------------------------------------------
bool ESP8266_Basic::read_MyFile(){
  bool readOK = false;
  File MyFile;
  //clean FS, for testing
  //SPIFFS.format();

  //read configuration from FS json
  Serial.println("");
  Serial.println("mounting FS...for MyFile");

  if (SPIFFS.begin()) {
    Serial.println("mounted file system");
    if (SPIFFS.exists("/MyFile.json")) {
      //file exists, reading and loading
      Serial.println("reading Myfile");
      MyFile = SPIFFS.open("/MyFile.json", "r");
      if (MyFile) {
        Serial.println("opened MyFile");
        size_t size = MyFile.size();
        // Allocate a buffer to store contents of the file.
        std::unique_ptr<char[]> buf(new char[size]);

        MyFile.readBytes(buf.get(), size);
        DynamicJsonBuffer jsonBuffer;
        JsonObject& json = jsonBuffer.parseObject(buf.get());
        //json.printTo(Serial);
        if (json.success()) {
          Serial.println("json success to MyFile");
          
		  //Get Data from File
          strcpy(myFile.Field_01, json["Field_01"]);
          strcpy(myFile.Field_02, json["Field_02"]);
		  
	      updateMeasure_time = String(myFile.Field_01).toInt();
          Serial.print("Update Time = ");
          Serial.println(updateMeasure_time);


		  readOK = true;

        } else {
          Serial.println("failed to load json MyFile");
        }
      }
    }else{
	  Serial.println("MyFile does not exist");
	}
  } else {
    Serial.println("failed to mount FS");
  }
  MyFile.close();
  //end read
  return readOK;

